toasterllc/MDCCode/Code/MSP430/MSP430ProgrammerTest/MSP430Programmer.h
// Instructions for the JTAG mailbox
//! \brief Request a JTAG mailbox exchange
#define IR_JMB_EXCHANGE            0x86   // original value: 0x61
//! \brief Instruction for test register in 5xx
#define IR_TEST_REG                0x54   // original value: 0x2A
//! \brief Instruction for 3 volt test register in 5xx
#define IR_TEST_3V_REG             0xF4   // original value: 0x2F

// Constants for JTAG mailbox data exchange
//! \brief JTAG mailbox constant - 
#define OUT1RDY 0x0008
//! \brief JTAG mailbox constant - 
#define IN0RDY  0x0001
//! \brief JTAG mailbox constant - 
#define JMB32B  0x0010
//! \brief JTAG mailbox constant - 
#define OUTREQ  0x0004
//! \brief JTAG mailbox constant - 
#define INREQ   0x0001
//! \brief JTAG mailbox mode 32 bit - 
#define MAIL_BOX_32BIT 0x10
//! \brief JTAG mailbox moede 16 bit - 
#define MAIL_BOX_16BIT 0x00

// Constants for runoff status
//! \brief return 0 = error
#define STATUS_ERROR     0      // false
//! \brief return 1 = no error
#define STATUS_OK        1      // true
//! \brief GetDevice returns this if the security fuse is blown
#define STATUS_FUSEBLOWN 2

//! \brief Replicator is active
#define STATUS_ACTIVE    2
//! \brief Replicator is idling
#define STATUS_IDLE      3

// dedicated addresses
//! \brief Triggers a regular reset on device release from JTAG control
#define V_RESET                    0xFFFE
//! \brief Triggers a "brown-out" reset on device release from JTAG control
#define V_BOR                      0x1B08

// Constants for VPP connection at Blow-Fuse
//! \brief Fuse blow voltage is supplied via the TDI pin
#define VPP_ON_TDI                 0
//! \brief Fuse blow voltage is supplied via the TEST pin
#define VPP_ON_TEST                 1

//! \brief Holds the value of TDO-bit
bool tdo_bit = false;
//! \brief Holds the last value of TCLK before entering a JTAG sequence
bool TCLK_saved = true;




bool TSTRead() {
    return P1IN & BIT4;
}

bool RSTRead() {
    return P1IN & BIT5;
}

void TSTWrite(bool x) {
    if (x)  P1OUT   |=  BIT4;
    else    P1OUT   &= ~BIT4;
}

void RSTWrite(bool x) {
    if (x)  P1OUT   |=  BIT5;
    else    P1OUT   &= ~BIT5;
}

void TSTDir(bool out) {
    if (out)    P1DIR   |=  BIT4;
    else        P1DIR   &= ~BIT4;
}

void RSTDir(bool out) {
    if (out)    P1DIR   |=  BIT5;
    else        P1DIR   &= ~BIT5;
}

#define TCKRead     TSTRead
#define TDIORead    RSTRead
#define TCKWrite    TSTWrite
#define TDIOWrite   RSTWrite
#define TCKDir      TSTDir
#define TDIODir     RSTDir


#define CPUFreqMHz 16
#define DelayUs(us) __delay_cycles(CPUFreqMHz*us);

void DelayMs(uint32_t ms) {
    for (volatile uint32_t i=0; i<ms; i++) {
        DelayUs(1000);
    }
}







//! \brief Delay function as a transition between SBW time slots
void nNOPS() {
    DelayUs(1);
}

//! \brief SBW macro: set TMS signal
void TMSH() {
    TDIOWrite(1);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    TCKWrite(1);
}
//! \brief SBW macro: clear TMS signal
void TMSL() {
    TDIOWrite(0);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    TCKWrite(1);
}
//! \brief SBW macro: clear TMS signal and immediately set it high again in
//! the SBWTCK low phase to enter the TDI slot with a high signal 
//! \details Only used to clock TCLK (=TDI for SBW) in Run-Test/IDLE mode of
//! the JTAG FSM 
void TMSLDH() {
    TDIOWrite(0);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    TDIOWrite(1);
    TCKWrite(1);
}
//! \brief SBW macro: Set TDI = 1
void TDIH() {
    TDIOWrite(1);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    TCKWrite(1);
}
//! \brief SBW macro: clear TDI signal
void TDIL() {
    TDIOWrite(0);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    TCKWrite(1);
}
//! \brief SBW macro: TDO cycle without reading TDO
void TDOsbw() {
    TDIODir(0);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    TCKWrite(1);
    TDIODir(1);
}
//! \brief SBW macro: TDO cycle with TDO read
void TDO_RD() {
    TDIODir(0);
    nNOPS();
    TCKWrite(0);
    nNOPS();
    tdo_bit = TDIORead();
    TCKWrite(1);
    TDIODir(1);
}


//  combinations of sbw-cycles (TMS, TDI, TDO)
//---------------------------------
void TMSL_TDIL(void)
{
    TMSL();
    TDIL();
    TDOsbw();
}
//---------------------------------
void TMSH_TDIL(void)
{
    TMSH();
    TDIL();
    TDOsbw();
}
//------------------------------------
void TMSL_TDIH(void)
{
    TMSL();
    TDIH();
    TDOsbw();
}
//-------------------------------------
void TMSH_TDIH(void)
{
    TMSH();
    TDIH();
    TDOsbw();
}
//------------------------------------
void TMSL_TDIH_TDOrd(void)
{
    TMSL();
    TDIH();
    TDO_RD();
}
//------------------------------------
void TMSL_TDIL_TDOrd(void)
{
    TMSL();
    TDIL();
    TDO_RD();
}
//------------------------------------
void TMSH_TDIH_TDOrd(void)
{
    TMSH();
    TDIH();
    TDO_RD();
}
//------------------------------------
void TMSH_TDIL_TDOrd(void)
{
    TMSH();
    TDIL();
    TDO_RD();
}

//----------------------------------------------------------------------------
//! \brief Set all JTAG pins to input direction - from target to REP430F
void IO_3state(void)
{
    TSTDir(0);
    RSTDir(0);
}

//----------------------------------------------------------------------------
//! \brief Set SBW pins to output direction - from REP430F to target
void configure_IO_SBW(void)
{
    TSTDir(1);
    RSTDir(1);
}

//----------------------------------------------------------------------------
//! \brief Set up I/O pins for JTAG communication
void DrvSignals(void)
{
    IO_3state();
  #if ( INTERFACE == SPYBIWIRE_IF )
    TSTWrite(0);
    RSTWrite(0);
    configure_IO_SBW();
  #else 
    JTAGOUT  = TDI | TMS | TCK | TCLK | RST;
    configure_IO_JTAG();
  #endif
}

//----------------------------------------------------------------------------
//! \brief Release I/O pins
void RlsSignals(void)
{
    IO_3state();
}

//----------------------------------------------------------------------------
//! \brief Function to set up the JTAG pins
void ConnectJTAG()
{
    // drive JTAG/TEST signals
    DrvSignals();
    DelayMs(15);             // delay 15ms
}

//----------------------------------------------------------------------------
//! \brief Function to stop the JTAG communication by releasing the JTAG signals
void StopJtag (void)
{
    // release JTAG/TEST signals
    RlsSignals();
    DelayMs(15);             // delay 15ms
}


//----------------------------------------------------------------------------
//! \brief Clear TCLK in Spy-Bi-Wire mode
//! \details enters with TCLK_saved and exits with TCLK = 0
void ClrTCLK_sbw(void)
{
    if (TCLK_saved)
    {
        TMSLDH();
    }
    else
    {
        TMSL();
    }

    TDIOWrite(0);

    TDIL();
    TDOsbw();    //ExitTCLK
    TCLK_saved = false;
}

//----------------------------------------------------------------------------
//! \brief Set TCLK in Spy-Bi-Wire mode
//! \details enters with TCLK_saved and exits with TCLK = 1
void SetTCLK_sbw(void)
{
   if (TCLK_saved)
   {
        TMSLDH();
   }
   else
   {
        TMSL();
   }

   TDIOWrite(1);

   TDIH();
   TDOsbw();    //ExitTCLK
   TCLK_saved = true;
}

//----------------------------------------------------------------------------
//! \brief Shift a value into TDI (MSB first) and simultaneously shift out a 
//! value from TDO (MSB first).
//! \param Format (number of bits shifted, 8 (F_BYTE), 16 (F_WORD), 
//! 20 (F_ADDR) or 32 (F_LONG))
//! \param Data (data to be shifted into TDI)
//! \return unsigned long (scanned TDO value)
unsigned long AllShifts(word Format, unsigned long Data)
{
   unsigned long TDOword = 0x00000000;
   unsigned long MSB = 0x00000000;
   word i;

   switch(Format)
   {
   case F_BYTE: MSB = 0x00000080;
     break;
   case F_WORD: MSB = 0x00008000;
     break;
   case F_ADDR: MSB = 0x00080000;
     break;
   case F_LONG: MSB = 0x80000000;
     break;
   default: // this is an unsupported format, function will just return 0
     return TDOword;
   }
   // shift in bits
   for (i = Format; i > 0; i--)
   {
        if (i == 1)                     // last bit requires TMS=1; TDO one bit before TDI
        {
          ((Data & MSB) == 0) ? TMSH_TDIL_TDOrd() : TMSH_TDIH_TDOrd();
        }
        else
        {
          ((Data & MSB) == 0) ? TMSL_TDIL_TDOrd() : TMSL_TDIH_TDOrd();
        }
        Data <<= 1;
        if (tdo_bit)
            TDOword++;
        if (i > 1)
            TDOword <<= 1;               // TDO could be any port pin
   }
   TMSH_TDIH();                         // update IR
   if (TCLK_saved)
   {
        TMSL_TDIH();
   }
   else
   {
        TMSL_TDIL();
   }

   // de-scramble bits on a 20bit shift
   if(Format == F_ADDR)
   {
     TDOword = ((TDOword << 16) + (TDOword >> 4)) & 0x000FFFFF;
   }
   
   return(TDOword);
}


//----------------------------------------------------------------------------
//! \brief Function for shifting a given 16-bit word into the JTAG data
//! register through TDI.
//! \param[in] word data (16-bit data, MSB first)
//! \return word (value is shifted out via TDO simultaneously)
word DR_Shift16(word data)
{
#ifdef SPYBIWIRE_MODE
    // JTAG FSM state = Run-Test/Idle
    if (TCLK_saved)
    {
        TMSH_TDIH();
    }
    else
    {
        TMSH_TDIL();
    }
    // JTAG FSM state = Select DR-Scan
    TMSL_TDIH();
    // JTAG FSM state = Capture-DR
    TMSL_TDIH();
#else
    // JTAG FSM state = Run-Test/Idle
    SetTMS();
    ClrTCK();
    SetTCK();

    // JTAG FSM state = Select DR-Scan
    ClrTMS();
    ClrTCK();
    SetTCK();
    // JTAG FSM state = Capture-DR
    ClrTCK();
    SetTCK();
#endif
    // JTAG FSM state = Shift-DR, Shift in TDI (16-bit)
    return(AllShifts(F_WORD, data));
    // JTAG FSM state = Run-Test/Idle
}



//----------------------------------------------------------------------------
//! \brief Reset target JTAG interface and perform fuse-HW check.
void ResetTAP(void)
{
    word i;

