toasterllc/MDCCode/Code/MSP430/MSP430ProgrammerTest/MSP430Programmer.h
#ifdef SPYBIWIRE_MODE
    // Reset JTAG FSM
    for (i = 6; i > 0; i--)
    {
        TMSH_TDIH();
    }
    // JTAG FSM is now in Test-Logic-Reset
    TMSL_TDIH();                 // now in Run/Test Idle
#else
    // process TDI first to settle fuse current
    SetTDI();
    SetTMS();
    SetTCK();

    // Reset JTAG FSM
    for (i = 6; i > 0; i--)
    {
        ClrTCK();
        SetTCK();
    }
    // JTAG FSM is now in Test-Logic-Reset
    ClrTCK();
    ClrTMS();
    SetTCK();
    ClrTCK();    
    SetTCK();
    ClrTCK();    
    // JTAG FSM is now in Run-Test/IDLE
#endif
}


//----------------------------------------------------------------------------
//! \brief Function for shifting a new instruction into the JTAG instruction
//! register through TDI (MSB first, but with interchanged MSB - LSB, to
//! simply use the same shifting function, Shift(), as used in DR_Shift16).
//! \param[in] byte Instruction (8bit JTAG instruction, MSB first)
//! \return word TDOword (value shifted out from TDO = JTAG ID)
word IR_Shift(byte instruction)
{
#ifdef SPYBIWIRE_MODE
    // JTAG FSM state = Run-Test/Idle
    if (TCLK_saved)
    {
        TMSH_TDIH();
    }
    else
    {
        TMSH_TDIL();
    }
    // JTAG FSM state = Select DR-Scan
    TMSH_TDIH();

    // JTAG FSM state = Select IR-Scan
    TMSL_TDIH();
    // JTAG FSM state = Capture-IR
    TMSL_TDIH();
#else
    // JTAG FSM state = Run-Test/Idle
    SetTMS();
    ClrTCK();
    SetTCK();
    // JTAG FSM state = Select DR-Scan
    ClrTCK();
    SetTCK();

    // JTAG FSM state = Select IR-Scan
    ClrTMS();
    ClrTCK();
    SetTCK();
    // JTAG FSM state = Capture-IR
    ClrTCK();
    SetTCK();
#endif
    // JTAG FSM state = Shift-IR, Shift in TDI (8-bit)
    return(AllShifts(F_BYTE, instruction));
    // JTAG FSM state = Run-Test/Idle
}


//----------------------------------------------------------------------------
//! \brief Function to start the JTAG communication - RST line high - device starts
//! code execution   
void EntrySequences_RstHigh_SBW()
{
    TSTWrite(0);    //1
    DelayMs(4); // reset TEST logic

    RSTWrite(1);    //2
    
    TSTWrite(1);    //3
    DelayMs(20); // activate TEST logic

    // phase 1
    RSTWrite(1);    //4
    DelayUs(60);

    // phase 2 -> TEST pin to 0, no change on RST pin
    // for Spy-Bi-Wire
    TSTWrite(0);
    // phase 3
    DelayUs(1);
    // phase 4 -> TEST pin to 1, no change on RST pin
    // for Spy-Bi-Wire
    TSTWrite(1);
    DelayUs(60);

    // phase 5
    DelayMs(5);
}

//! \brief Function to start the SBW communication - RST line low - device do not 
//! start code execution   
void EntrySequences_RstLow_SBW()
{
    TSTWrite(0);                //1
    DelayMs(1);       // reset TEST logic
    
    RSTWrite(0);                //2
    DelayMs(50);
      
    TSTWrite(1);                //3
    DelayMs(100);     // activate TEST logic

    // phase 1
    RSTWrite(1);                //4
    DelayUs(40);

    // phase 2 -> TEST pin to 0, no change on RST pin
    // for Spy-Bi-Wire
    TSTWrite(0);                  //5
    DelayUs(1);
    // phase 4 -> TEST pin to 1, no change on RST pin
    // for Spy-Bi-Wire
    TSTWrite(1);      //7
    DelayUs(40);
    DelayMs(5);
}

//! \brief Function to start the JTAG communication - RST line high - device starts
//! code execution   
void EntrySequences_RstHigh_JTAG()
{
    TSTWrite(0);    //1
    DelayMs(4); // reset TEST logic

    RSTWrite(1);    //2
    
    TSTWrite(1);    //3
    DelayMs(20); // activate TEST logic

    // phase 1
    RSTWrite(0);    //4
    DelayUs(60);

    // phase 2 -> TEST pin to 0, no change on RST pin
    // for 4-wire JTAG clear Test pin
    TSTWrite(0);  //5

    // phase 3
    DelayUs(1);

    // phase 4 -> TEST pin to 1, no change on RST pin
    // for 4-wire JTAG
    TSTWrite(1);//7
    DelayUs(60);

    // phase 5
    RSTWrite(1);
    DelayMs(5);
}

//! \brief Function to start the JTAG communication - RST line low - device do not 
//! start code execution   
void EntrySequences_RstLow_JTAG()
{
    TSTWrite(0);                    //1    
    DelayMs(4);                  //reset TEST logic
    
    RSTWrite(0);                    //2
    DelayMs(50);
    
    TSTWrite(1);                   //3
    DelayMs(50);                 //activate TEST logic
               
    RSTWrite(0);                   //4
    DelayUs(40);

     // for 4-wire JTAG clear Test pin Test(0)   
    TSTWrite(0);                   //5
    DelayUs(2);

    // for 4-wire JTAG -dry  Reset(0)
    RSTWrite(0);                          
    DelayUs(2);

    // 4-wire JTAG - Test (1)
    TSTWrite(1);
    DelayMs(5);
    
    RSTWrite(1);
}



//----------------------------------------------------------------------------
//! \brief Write a 16bit value into the JTAG mailbox system.
//! The function timeouts if the mailbox is not empty after a certain number
//! of retries.
//! \param[in] word dataX (data to be shifted into mailbox)
short i_WriteJmbIn16(word dataX)
{
    unsigned short sJMBINCTL;
    unsigned short sJMBIN0;
    unsigned long Timeout = 0;
    sJMBIN0 = (unsigned short)(dataX & 0x0000FFFF);
    sJMBINCTL = INREQ;

    IR_Shift(IR_JMB_EXCHANGE); 
    do
    {
        Timeout++;
        if(Timeout >= 3000)
        {
            return STATUS_ERROR;
        }
    }
    while(!(DR_Shift16(0x0000) & IN0RDY) && Timeout < 3000);
    if(Timeout < 3000)
    {
        DR_Shift16(sJMBINCTL);
        DR_Shift16(sJMBIN0);
    }
    return STATUS_OK;
}



//----------------------------------------------------------------------------
//! \brief Start JTAG communication in JSBW mode.
//! \param byte states (reset state)
void StartJtagJSbw(byte states)
{
    // reset TEST logic  
    TSTWrite(0);
    DelayMs(20);             // delay 20ms
    
    if(states == RSTLOW_SBW || states == RSTLOW_JTAG)
    {   
        // Set Reset pin 0
        RSTWrite(0);
    }
    else
    {   
        // Set Reset pin = 1 
        RSTWrite(1);
    }  

    TSTWrite(1);
    // activate TEST logic
    DelayMs(25); 

    // phase 1
    if(states == RSTLOW_JTAG || states == RSTHIGH_JTAG)
    {
        //Set Reset pin =0 
        RSTWrite(0);
    }
    else
    {
        RSTWrite(1);
    }  
    DelayUs(40); 
    
    // phase 2 -> TEST pin to 0, no change on RST pin
    if(states == RSTLOW_SBW || states == RSTHIGH_SBW)
    { 
        // for Spy-Bi-Wire
      //  JTAGOUT &= ~SBWCLK;
    }
    else
    { 
        // for 4-wire JTAG
        TSTWrite(0);
    }
    
    // phase 3
    if(states == RSTLOW_JTAG)
    {
        RSTWrite(1);
    }
    DelayUs(1); 
    
    // phase 4 -> TEST pin to 1, no change on RST pin
    if(states == RSTLOW_SBW || states == RSTHIGH_SBW)
    { 
        // for Spy-Bi-Wire
     //   JTAGOUT |=   SBWCLK;
    }
    else
    { 
        // for 4-wire JTAG
        TSTWrite(1);
    }
    DelayUs(40); 
    
    // phase 5
    if(states == RSTHIGH_JTAG)
    {
        RSTWrite(1);
    }
    DelayMs(5);    
}


//----------------------------------------------------------------------------
//! \brief Reset target JTAG interface and perform fuse-HW check.
void jResetJtagTap(void)
{
    word i;  
    // Check Fuse, Reset JTAG FSM
    for (i = 6; i > 0; i--)      // 6 is nominal
    {
        TMSH_TDIH();
    }
    // JTAG FSM is now in Test-Logic-Reset
    TMSL_TDIH();                 // now in Run/Test Idle
}   

//----------------------------------------------------------------------------
//! \brief Shift a value into TDI (MSB first) and simultaneously shift out a 
//! value from TDO (MSB first).
//! \param word Format (number of bits shifted, 8 (F_BYTE), 16 (F_WORD), 
//! 20 (F_ADDR) or 32 (F_LONG))
//! \param long Data (data to be shifted into TDI)
//! \return unsigned long (scanned TDO value)
long jsbw_Shift(word Format, long Data)
{
    return AllShifts(Format, Data);
}

//----------------------------------------------------------------------------
//! \brief Function for shifting a new instruction into the JTAG instruction
//! register through JSBW (MSB first, but with interchanged MSB - LSB, to
//! simply use the same shifting function Shift()).
//! \param instruction (8 bit JTAG instruction)
//! \return word (TDOword - value shifted out from TDO: JTAG identification)
long jsbw_IR_Shift(byte instruction)
{
    // JTAG FSM state = Select DR-Scan
    TMSH_TDIH();

    // JTAG FSM state = Select IR-Scan
    TMSL_TDIH();
    // JTAG FSM state = Capture-IR
    TMSL_TDIH();
    // JTAG FSM state = Shift-IR, Shift in TDI (8-bit)
    return(jsbw_Shift(F_BYTE, instruction));
    // JTAG FSM state = Run-Test/Idle
}

//----------------------------------------------------------------------------
//! \brief Function for shifting data into the JTAG data register through JSBW 
//! (MSB first, but with interchanged MSB - LSB, to simply use the same shifting 
//! function Shift()).
//! \param data
//! \return word (TDOword - value shifted out from TDO: JTAG identification)
long jsbw_DR_Shift(long data)
{
    // JTAG FSM state = Run-Test/Idle
    if (TCLK_saved)
    {
        TMSH_TDIH();
    }
    else
    {
        TMSH_TDIL();
    }
    // JTAG FSM state = Select DR-Scan
    TMSL_TDIH();
    // JTAG FSM state = Capture-DR
    TMSL_TDIH();        
    // JTAG FSM state = Shift-DR, Shift in TDI (16-bit)
    return(jsbw_Shift(F_WORD, data));
    // JTAG FSM state = Run-Test/Idle
}

//----------------------------------------------------------------------------
//! \brief Function for applying the magic pattern via JSBW.
void JsbwMagicPattern(void)
{
    jsbw_IR_Shift(IR_JMB_EXCHANGE);
    DelayMs(10);       
    jsbw_DR_Shift(0x0001);
    DelayMs(10);    
    jsbw_DR_Shift(STOP_DEVICE);    
    DelayMs(15);        
}


//----------------------------------------------------------------------------
//! \brief Releases the JSBW logic.
void jRelease(void)
{
    RSTWrite(0);
    DelayMs(1);
    TSTWrite(0);
}

//----------------------------------------------------------------------------
//! \brief Set JTAG pins to output direction - from REP430F to target
void configure_IO_JTAG(void)
{
    TSTDir(1);
    RSTDir(1);
}

//----------------------------------------------------------------------------
//! \brief Function for resetting the JTAG lock via JSBW.
void jsbwJtagUnlock(void)
{    
    jsbw_IR_Shift(IR_TEST_3V_REG);
    DelayMs(10);  
    jsbw_DR_Shift(0x4020);
    DelayMs(10);  
}


//----------------------------------------------------------------------------
//! \brief Function to enable JTAG communication with a target. Use JSBW mode
//!  if device is in LPM5 mode.
//! \return word (JTAG_ID91(0x91) if connection was established successfully, 
//! invalid JTAG ID (0x1) otherwise)
word magicPattern(void)
{
    volatile word deviceJtagID = 0;
    
